In [1]:
import pyodbc
import pandas as pd
import numpy as np
import os

# Making list of names with suspicious activity

In [9]:
os.chdir('C:\\Users\\hp\\Desktop\\ProFinch')
df=pd.DataFrame()
df=pd.read_excel("CustomerInfo5.xlsx")

In [13]:
df_fraud=pd.DataFrame()
df_fraud['first_name']=""
df_fraud['last_name']=""

In [14]:
ct=0
for i in range(1000):
    if(df['Suspicious Activity'][i]==True):
            df_fraud.loc[ct,'first_name']=df['first_name'][i]
            df_fraud.loc[ct,'last_name']=df['last_name'][i]
            ct=ct+1

In [15]:
df_fraud

    first_name  last_name
0       Correy    Antunez
1        Welby    Zanazzi
2       Bailie     Keppel
3        Rayna    Josephs
4       Noelle   Sterrick
..         ...        ...
341     Angela      Aiken
342     Verena  Grimsdyke
343   Casandra        Old
344      Griff      Thame
345     Rainer    Durante

[346 rows x 2 columns]

In [33]:
df.columns.tolist()

['first_name',
 'last_name',
 'gender',
 'age',
 'country',
 'state',
 'postal code',
 'social security number',
 'company',
 'job title',
 'salary',
 'card number',
 'card type',
 'money_withdrawn_amount',
 'money_withdrawn_reason',
 'money_withdrawn_location',
 'money_withdrawn_time',
 'Suspicious Activity',
 'No.of Transactions']

In [32]:
df.dtypes

first_name                   object
last_name                    object
gender                       object
age                           int64
country                      object
state                        object
postal code                   int64
social security number       object
company                      object
job title                    object
salary                        int64
card number                   int64
card type                    object
money_withdrawn_amount      float64
money_withdrawn_reason       object
money_withdrawn_location     object
money_withdrawn_time         object
Suspicious Activity            bool
No.of Transactions            int64
dtype: object

In [31]:
# df=df.drop(['Unnamed: 0','Unnamed: 0.1'], axis = 1) 
# df=df.drop(['Valid Transaction'], axis = 1)

In [38]:
df.head()

,first_name,last_name,gender,age,country,state,postal code,social security number,company,job title,salary,card number,card type,money_withdrawn_amount,money_withdrawn_reason,money_withdrawn_location,money_withdrawn_time,Suspicious Activity,No.of Transactions
0,Barrett,Dybell,Male,73,United States,Colorado,80935,655-91-9407,Fiveclub,Actuary,49224,3558725889734846,jcb,6823.85,Electronics,California,3:46 PM,False,1
1,Correy,Antunez,Male,65,United States,Texas,76115,591-95-0381,Youfeed,Marketing Manager,122588,3531226201855205,jcb,28609.13,Movies,New York,6:56 AM,False,3
2,Robbi,Amsden,Female,24,United States,Florida,34611,539-05-0912,Trilith,Operator,100195,3577207464865995,jcb,11985.45,Sports,Kansas,12:30 PM,False,3
3,Welby,Zanazzi,Male,61,United States,Texas,75353,151-75-0158,Avamba,Developer III,53624,633401356658267264,solo,1686.59,Tools,Kansas,12:17 AM,False,8
4,Bailie,Keppel,Male,52,United States,New Mexico,88006,667-83-6790,Zoombox,Quality Control Specialist,29958,3576156388252940,jcb,26964.59,Industrial,Texas,2:01 PM,True,2

In [36]:
dict_new={
"first_name":[],
"last_name":[],
"gender":[],
"age":[],
"country":[],
"state":[],
"postal code":[],
"social security number":[],
"company":[],
"job title":[],
"salary":[],
"card number":[],
"card type":[],                    
"money_withdrawn_amount":[],
"money_withdrawn_reason":[],       
"money_withdrawn_location":[],
"money_withdrawn_time":[],
"Suspicious Activity":[],
"No.of Transactions":[]
}

add a row using query
call runsql function
if the rule satifies add the names to df_fraud

# Insert a row into DB and check rules

In [ ]:
# ('iron','man','Male',24,'United States','Colorado', 80935.0, '785-91-9407', 'Fiveclub', 'Actuary', 10224.0, 3558725889734886.0, 'jcb', 6823.85, 'Electronics', 'California', '3:46 PM', True, False, 3.0)

In [44]:
string="insert into output values('0.0','iron','man','Male',24,'United States','Colorado', 80935.0, '785-91-9477', 'Fiveclub', 'Actuary', 10224.0, 3558725889734886.0, 'jcb', 6823.85, 'Electronics', 'California', '3:46 PM', 'True', 'False', 3.0)"

In [45]:
conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
query=string
cursor = conx.cursor();
cursor.execute(query);
conx.commit()

In [62]:
conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
query="SELECT [first_name],[last_name],[social security number],[Suspicious Activity] FROM [kk].[dbo].[output]"
cursor = conx.cursor();
cursor.execute(query);
data = cursor.fetchall()
q = pd.read_sql_query(query,conx)
df2 = pd.DataFrame(q, columns=['first_name','last_name','social security number','Suspicious Activity'])
conx.close()

In [64]:
for i in range(1001):
    if(df2['first_name'][i]=="iron"):
       print(df2['Suspicious Activity'][i]==False)
       print(i)

True
500

In [3]:
file1 = open('Rules.txt', 'r') 
Lines = file1.readlines() 
List=[]  
count = 0
# Strips the newline character 
for line in Lines: 
#     print(line.strip()) 
    print("Line{}: {}".format(count, line.strip()))
    print(0)
    count=count+1
    List.append(line.strip())

Line0: select first_name,last_name,MIN(gender) AS gender,MIN(age) AS age,MIN(country) AS country,MIN(state) AS state,MIN([postal code]) AS [postal code],MIN([social security number]) AS [social security number],MIN([company]) AS [company],MIN([job title]) AS [job title],MIN([salary]) AS [salary],MIN([card number]) AS [card number],MIN([card type]) AS [card type],SUM(money_withdrawn_amount) AS money_withdrawn_amount,MIN([money_withdrawn_reason]) AS [money_withdrawn_reason],MIN([money_withdrawn_location]) AS [money_withdrawn_location],MIN([Suspicious Activity]+0) AS [Suspicious Activity],MIN([No.of Transactions]) AS [No.of Transactions],MIN([money_withdrawn_date]) AS [money_withdrawn_date],MIN([money_withdrawn_date_only]) AS [money_withdrawn_date_only]FROM output2 GROUP BY first_name,last_name,money_withdrawn_date_only
Line1: SELECT [first_name],[last_name],[social security number] FROM [kk].[dbo].[output3] WHERE ([money_withdrawn_amount])>=([salary]/2)
Line2: SELECT [first_name],[last_name],[social security number] FROM [kk].[dbo].[output3] WHERE [Total amount transferred]>=([salary])
Line3: select * from output3 where (([Time_only]>'01:00:01' and [Time_only]<'04:00:59')) or ([state]!=[money_withdrawn_location]) or (([money_withdrawn_amount])>=([salary]/2))

In [66]:
def runsql(x):
    global data,df2
    conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
    query=x
    cursor = conx.cursor();
    cursor.execute(query);
    data = cursor.fetchall()
    q = pd.read_sql_query(query,conx)
    df2 = pd.DataFrame(q, columns=['first_name','last_name','social security number'])
    conx.close()

In [67]:
for i in range(len(List)):
    runsql(List[i])
    print(df2.head())

  first_name last_name social security number
0     Bailie    Keppel            667-83-6790
1      Rayna   Josephs            248-61-5179
2       Cull    Tabour            205-43-7993
3     Noelle  Sterrick            294-48-6337
4     Maximo  Switland            171-39-7066

In [68]:
len(df2)

340

In [75]:
ct=len(df_fraud)
for i in range(len(df2)):
    if(((df2['first_name'][i] in df_fraud['first_name'].unique())==False) and ((df2['last_name'][i] in df_fraud['last_name'].unique())==False)):
        df_fraud.loc[ct,'first_name']=df2['first_name'][i]
        df_fraud.loc[ct,'last_name']=df2['last_name'][i]
        ct=ct+1

In [77]:
df_fraud.tail()

    first_name  last_name
335     Shadow      Stife
336     Angela      Aiken
337     Verena  Grimsdyke
338   Casandra        Old
339       iron        man

In [79]:
conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
query="create table fraud_names(first_name varchar(50),last_name varchar(50))"
cursor = conx.cursor();
cursor.execute(query);
conx.commit()

In [16]:
import urllib
import sqlalchemy
conn_str = (
    r'Driver={SQL Server};'
    r'Server=DESKTOP-V8F09K2\KRISHNASQL;'
    r'Database=kk;'
    r'UID=sa;'
    r'PWD=pokemon;'
)
quoted_conn_str = urllib.parse.quote_plus(conn_str)
engine = sqlalchemy.create_engine('mssql+pyodbc:///?odbc_connect={}'.format(quoted_conn_str))
cnxn = engine.connect()

In [8]:
rows = cnxn.execute("SELECT name FROM sys.tables").fetchall()
# df_fraud.to_sql('fraud_names', con=engine,if_exists='replace')
print(rows)

[('output',), ('output2',), ('fraud_names',), ('output3',)]

In [17]:
df_fraud.to_sql('fraud_names', con=engine,if_exists='replace')

In [11]:
df.to_sql('output3', con=engine,if_exists='replace')

In [108]:
rows = cnxn.execute("SELECT * FROM fraud_names").fetchall()
print(rows[:3])
print(len(rows))

[(0, 'Bailie', 'Keppel'), (1, 'Rayna', 'Josephs'), (2, 'Cull', 'Tabour')]
340